[
  {
    "title": "GUNS UP! Mobile Mod Apk 1.12.20 for android",
    "imgSrc": "https://www.revdl.com/wp-content/uploads/2023/03/GUNS-UP-Mobile.jpg",
    "createdAt": "18 April 2023",
    "categories": "Games,Strategy",
    "version": "1.12.20",
    "fileSize": "331 MB",
    "allText": "GUNS UP! Mobile Mod Apk 1.12.20 for android, GUNS UP! Mobile is a Strategy Game for android, A call to all commanders out there:\nthe world is at war and it’s up to you to rise up and lead us to victory!, Guns up! ™ Mobile is an online PvP strategy game that brings a new twist to tower defense battles. Build an army, send your troops into battle and support your soldiers. Command them and support them with your choice of deployments from tanks to airstrikes! Tons of content awaits in this new take on the PlayStation® classic!, <img decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://image.revdl.com/2019/GUNS-UP-Mobile-1.jpg\" alt=\"GUNS UP Mobile War Strategy\" width=\"498\" height=\"230\" />, FIGHT YOUR WAY\nCompete in asynchronous multiplayer battles pitting attackers against other players’ defenses. Bring your best soldiers, create your battle strategies and dominate the battlefield. War trophies are waiting for you!, Accept challenges\nIf PvP isn’t your thing, you can also take part in several single player challenges. Fight through developer-made puzzle bases, defend against hordes of zombies, break out of military prisons and much more!, BUILD YOUR BASE\nPlan, expand and upgrade your base to build a solid defense against attackers and protect your most valuable resources. Watch replays of your opponent’s attacks and improve your defensive strategy to create the ultimate base defense.\nForm an alliance\nForm alliances with your friends and fight alongside them in alliance wars for loot and glory on the leaderboards. Work together by coordinating strategies, awarding resources, unlocking new facilities and sharing the spoils of war. Each Alliance War season brings new challenges and content for you to enjoy together!, <img decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://image.revdl.com/2019/GUNS-UP-Mobile-2.jpg\" alt=\"GUNS UP Mobile War Strategy\" width=\"498\" height=\"230\" />, There is no time to waste, Commander. Get ready to fight!\nDownload GUNS UP! ™ Get mobile now and join thousands of commanders online!, Network connection is required to play., #GUNS UP! Mobile™ is free to download and play, but some currencies and in-app items can be purchased for real money. You must be at least 13 years old to play or download GUNS UP! mobile Please review our Terms of Service and Privacy Policy for more details., [optional access permissions], – Storage: Required to attach documents when contacting customer support, download last version of GUNS UP! Mobile Mod Apk for android from revdl with direct link, <img decoding=\"async\" class=\"aligncenter size-medium\" src=\"https://image.revdl.com/2019/GUNS-UP-Mobile-3.jpg\" alt=\"GUNS UP Mobile War Strategy apk\" width=\"498\" height=\"230\" />, ",
    "downloadFile": [
      {
        "href": "http://s1.revdl.com/1901/GUNS_UP_Mobile_1.12.20__0151_Revdl.com.apk",
        "innerText": "Download Apk v1.12.20"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "Themes for Huawei & Honor 15.5.1 Apk + Mod (Full/ Adfree) for android",
    "imgSrc": "https://www.revdl.com/wp-content/uploads/2019/12/themes-for-huawei-amp-honor.jpg",
    "createdAt": "18 April 2023",
    "categories": "Apps,Personalization",
    "version": "15.5.1",
    "fileSize": "16 MB | 10 MB",
    "allText": "Themes for Huawei & Honor 15.5.1 Apk + Mod (Full/ Adfree) for android, Themes for Huawei & Honor  is a Personalization Game for android\ndownload last version of Themes for Huawei & Honor  Apk + Mod (Full/ Adfree) for android from revdl with direct link, Tired of boring wallpaper, icons or themes entirely?\nThe Application Themes for Huawei & Honor will help you get rid of this problem.\nJust go to the application, select the favorite theme for your Huawei or Honor device and install., And also with the help of the Themes for Huawei & Honor you can, Only for Huawei & Honor devices:\n Download themes, icons and fonts\n Convert icon packs to work with EMUI and MagicUI\n Save favorite themes in your personal profile\n Share your themes with other people, For all phones:\n Apply desktop wallpapers\n Apply 3D Live Wallpapers, ",
    "downloadFile": [
      {
        "href": "https://s13.revdl.com/1901/Themes_for_Huawei_Honor_15.5.1__5066_Revdl.com.apk",
        "innerText": "Download Apk v15.5.1"
      },
      {
        "href": "https://s13.revdl.com/1901/Themes_for_Huawei_&_Honor_Ad_Free_15.1.20__9406_Revdl.net.apk",
        "innerText": "Download Apk Mod v15.1.20"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "Netflix Mod Apk 8.65.0 Premium for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "18 April 2023",
    "categories": "Apps,Entertainment",
    "version": "8.65.0",
    "fileSize": "99 MB | 99 MB",
    "allText": "Netflix Mod Apk 8.65.0 Premium for android, Netflix Mod Apk  is a Entertainment Game for android.download latest version Netflix Premium Mod  Apk for android from revdl with direct link., Netflix Mod Apk is the world’s leading subscription service for watching TV episodes and movies on your phone. This Netflix mobile application delivers the best experience anywhere, anytime., Get the free app as a part of your Netflix membership and you can instantly watch thousands of TV episodes & movies on your phone., If you are not a Netflix member sign up for Netflix and start enjoying immediately on your phone with our one-month free trial., How does Netflix work?• Netflix membership gives you access to unlimited TV shows and movies for one low monthly price.• With the Netflix app you can instantly watch as many TV episodes & movies as you want, as often as you want, anytime you want.• You can Browse a growing selection of thousands of titles, and new episodes that are added regularly.• Search for titles and watch immediately on your phone or on an ever expanding list of supported devices.• Rate your favorite shows and movies and tell us what you like so Netflix can help suggest the best titles for you.• Start watching on one device, and resume watching on another. Check out netflix.com for all the TVs, game consoles, tablets, phones, Blu-ray players and set top boxes on which you can watch Netflix., By clicking INSTALL, you consent to the installation of the Netflix application and any updates or upgrades thereto., 1-month free Netflix membership offer is available to first time and certain former members and cannot be combined with any other offer. Internet access and valid payment method are required to redeem offer.  Netflix will begin to bill your payment method for the Netflix membership fee at the end of the free month unless you cancel prior to the end of the first month. Your Netflix membership is a month-to-month subscription that you can cancel at any time. Go to “Your Account” on the Netflix website for cancellation instructions. No refund or credit for partial monthly subscription periods. A device that streams from Netflix (manufactured and sold separately) and broadband Internet connection are required to watch instantly., <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2017/netflix-1.jpg\" alt=\"Netflix mod apk\" width=\"280\" height=\"460\">, , <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2017/netflix-2.jpg\" alt=\"Netflix Mod Premium for android\" width=\"280\" height=\"460\">, , <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2017/netflix-3.jpg\" alt=\"Netflix Mod Apk pro download\" width=\"280\" height=\"460\">, , ",
    "downloadFile": [
      {
        "href": "https://s1.revdl.com/1901/Netflix_8.65.0__8034_Revdl.com.apk",
        "innerText": "Download Apk v8.65.0 [Final]"
      },
      {
        "href": "https://s1.revdl.com/1901/Netflix_beta_8.65.0__0835_Revdl.com.apk",
        "innerText": "Download Apk v8.65.0"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "Deezer Mod Apk 7.0.27.27 [Premium unlocked] for android",
    "imgSrc": "https://www.revdl.com/wp-content/uploads/2022/07/Deezer.jpg",
    "createdAt": "18 April 2023",
    "categories": "Apps,Radio music and TV",
    "version": "7.0.27.27",
    "fileSize": "33 MB ~",
    "allText": "Deezer Mod Apk 7.0.27.27 [Premium unlocked] for android, Deezer Premium Mod Apk is an android app that is a practical application for playing music online, published by Deezer Mobile. You can nofbgg search for your favorite song based on artist or song name. You can also read the lyrics of the music. Deezer: Music & Podcast Player Mod pro unlocked for android from revdl with direct link., <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Deezer-1.jpg\" alt=\"Download Deezer Mod Apk\" width=\"299\" height=\"533\" />, <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Deezer-2.jpg\" alt=\"Download Deezer pro apk mod\" width=\"299\" height=\"533\" />, <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Deezer-3.jpg\" alt=\"Download Deezer premium mod apk\" width=\"299\" height=\"533\" />, ",
    "downloadFile": [
      {
        "href": "https://s1.revdl.com/1901/Deezer_Music_Podcast_Player_7.0.27.27__5661_Revdl.com.apk",
        "innerText": "Download Apk v7.0.27.27 [Original]"
      },
      {
        "href": "https://s1.revdl.com/1901/Deezer_Music_Podcast_Player_Beta_7.0.19.1__7607_Revdl.com.apk",
        "innerText": "Download Apk v7.0.19.1 [Beta]"
      },
      {
        "href": "https://s1.revdl.com/1901/Deezer_Music_Song_Streaming_Premium_Beta_7.0.9.1__6475_Revdl.com.apk",
        "innerText": "Download Apk v7.0.9.1 [Premium Beta]"
      },
      {
        "href": "https://s1.revdl.com/1901/Freezer_Android_Deezer_Downloader_Streamer_0.6.14__9129_Revdl.com.apk",
        "innerText": "Downloader Apk Deezer Downloader Streamer v0.6.14"
      },
      {
        "href": "https://s1.revdl.com/1901/Deezer_Music_Podcast_Player_Premium_7.0.22.1__6350_Revdl.com.apk",
        "innerText": "Download Apk v7.0.22.1 [Premium]"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "AppLock Premium 5.6.7 Apk for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "18 April 2023",
    "categories": "Apps,Tools",
    "version": "5.6.7",
    "fileSize": "25 MB | 4 MB",
    "allText": "AppLock Premium 5.6.7 Apk for android, AppLock Premium  is a Tools Game for android2\ndownload last version of AppLock  Apk for android from revdl with direct link, Fingerprint lock only works in Android 6.0+. Unlock more easily and quickly.\nAdd intruder selfie, private SNS and incognito browser.\nMost downloaded app lock in Play Store. Protect privacy with password, pattern, fingerprint lock.\n★ #1 App lock in over 50 countries.\n★ Over 300 Million users, supports 32 languages., ☞ AppLock can lock Facebook, Whatsapp, Gallery, Messenger, Snapchat, Instagram, SMS, Contacts, Gmail, Settings, incoming calls and any app you choose. Prevent unauthorized access and guard privacy. Ensure security.\n☞ AppLock can hide pictures and videos. Hidden pictures and videos are vanished from Gallery and only visible in the photo and video vault. Protect private memories easily. No pin, no way.\n☞AppLock has random keyboard and invisible pattern lock. No more worry people may peep the pin or pattern. More safe!, ★ With AppLock, you will:\nNever worry about parents check your Snapchat, Musical.ly!\nNever worry about friends borrow your phone to play games with mobile data again!\nNever worry about a workmate gets your phone to look the gallery again!\nNever worry about someone reads private data in your apps again!\nNever worry about kids mess up Settings, send wrong messages, paying games again!, —FAQ—\n1)How to change password?\nOpen AppLock, Protect, Unlock Settings, 2)I hide AppLock icon, how to open AppLock now? \nThere are two ways to open it:\n1. Enter #password in your dial pad, and tap call button.\n2. Open domobile.com/applock in the browser., 3)How to stop other people uninstall AppLock?\nPlease enable Advanced Protection in Protect of AppLock, so nobody can uninstall or kill AppLock without password. You can disable Advanced Protection when you don’t want it., 4)How to uninstall AppLock?\nAfter you enable Advanced Protection, nobody can uninstall AppLock without password. If you want to uninstall it, please disable Advanced Protection first., 5)I forgot my password, How to find it?\nUpdate to the latest version first. And then tap AppLock icon, click the icon at top right corner of lock page, tap ‘forgot password’.\n1. Security answer: enter security answer, click ‘reset password’.\n2. Security email: click ‘send code to security email’, input reset code, click ‘reset password’., —Features—\n• Lock apps with password lock, pattern lock, or fingerprint lock.\n• Photo vault, hide pictures\n• Video vault, hide videos\n• Well designed Themes\n• Customized background, select a favorite picture\n• Default profiles: Unlock all, Guest\n• Customized Profiles: set different locked app groups, change lock quickly\n• Time Lock: auto-lock/unlock according to time\n• Location Lock: auto-lock/unlock according to location\n• Hide AppLock icon\n• Advanced Protection: prevent AppLock being killed by task killer\n• Random keyboard: prevent people peeping pin code\n• Fingerprint、Force stopped cover\n• Lock switch (WiFi, Bluetooth, mobile data, sync)\n• AppLock widget: enable/disable AppLock with one tap\n• Quick lock switch: Lock/unlock in notification bar\n• Lock incoming calls\n• Lock system settings to prevent a mess by kids\n• Lock Google Play to prevent buy games\n• Allow a brief exit: no need password, pattern, fingerprint again within set time\n• Prevent uninstalling apps\n• Low memory usage.\n• Power saving mode to save battery, AppLock uses the Device Administrator permission.\nTo enable Advanced Protection, please activate AppLock as “device administrator”. It\\’s only used for preventing intruders uninstalling AppLock. Please be assured that AppLock will never use this permission to access your privacy data., ",
    "downloadFile": [
      {
        "href": "https://s2.revdl.com/1901/AppLock_Premium_5.6.7_4155_Revdl.com.apk",
        "innerText": "Download Apk v5.6.7"
      },
      {
        "href": "https://s2.revdl.com/1901/AppLock_Premium_2.8.10_Mod__7745_Revdl.com.apk",
        "innerText": "Download Apk Mod v2.8.10"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "2ndLine – Second Phone Number Apk 23.15.0.2 Full for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "18 April 2023",
    "categories": "Apps,Communication",
    "version": "23.15.0.2",
    "fileSize": "159 MB | 159 MB",
    "allText": "2ndLine – Second Phone Number Apk 23.15.0.2 Full for android, 2ndLine – Second Phone Number  is a Communication Game for android\ndownload last version of 2ndLine – Second Phone Number  Apk for android from revdl with direct link, 2ndLine is a second US or Canada phone number that works on your smartphone, tablets as a full-featured business phone system, designed for mobile professionals, freelancers, and entrepreneurs. Call and message from a separate number on devices you and your team already have, via Wi-Fi or your existing cellular network, with anyone in the U.S. and Canada., Local Phone number\nGive your friends your very own phone number they can call!, Unlimited Text & Picture Messaging\nYou can send as many text messages as you want to US & Canada – FREE!, Unlimited Calling to USA and Canada\nMake unlimited free phone calls to any phone number in the US & Canada!, Cheap International Calling\nAdd money or earn free money by completing offers to your account and make low-cost international calls, Features:\n– Make and receive voice calls\n– Emojis, stickers and gifs\n– Full picture messaging : send, receive and save pictures!\n– Voicemail Transcription: transcript of your voicemail\n– Caller ID\n– PassCode: keep your messages under lock and key\n– Google SmartLock: no need to remember your password\n– Call Forwarding\n– Signatures: add your own signature to each text\n– Customizable text-tone, ringtone & vibration\n– Customizable backgrounds\n– Assign individual contacts their own ringtone & background\n– Quick Reply to easily (and quickly) respond to friends\n– Unified inbox: send and receive your texts directly via 2ndLine – use 2ndLine as your one-stop SMS texting app!\n-Elastic calling is 2ndLine’s unique ability to have our calls choose the best possible route for your call to improve quality, ",
    "downloadFile": [
      {
        "href": "https://s12.revdl.com/1901/2ndLine_Second_Phone_Number_Free_22.25.0.0__8885_Revdl.com.apk",
        "innerText": "Download Apk v22.25.0.0"
      },
      {
        "href": "https://s12.revdl.com/1901/2ndLine_Second_Phone_Number_23.15.0.2__7846_Revdl.com.apk",
        "innerText": "Download Apk Full v23.15.0.2"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "KineMaster Pro Mod Apk 7.0.0.29940.GP Full Unlocked for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "17 April 2023",
    "categories": "Apps,Media & Video,Top Apps",
    "version": "7.0.0.29940",
    "fileSize": "83 MB | 83 MB | 84 MB | 84 MB |",
    "developer": "KineMaster Corporation",
    "allText": "Download KineMaster Pro Mod apk 7.0.0.29940.GP Full Unlocked for android [Premium], A great program for editing your videos is Kinemaster Pro Mod Apk, which is available for download for Android platforms, and that is one of the advanced user interfaces that have many mods and great premium features that are fully unlocked. You will be amazed by the many features of this program, and it will allow you to edit a lot of your videos; and it was selected as one of the best and most successful video editing programs in 2021., <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2015/01/kinemaster_pro_video_editor_1.jpg\" alt=\"Download kinemaster pro apk\" width=\"460\" height=\"280\" />, Kinemaster mod apk cracked version is for editing your videos, and despite the increase in features, working with this program has become simple and enjoyable. After downloading By entering this software, you need to add several videos or photos that you want, and then it will be time to edit., With this premium apk, you can set a special theme for your movies, and you can even set background songs or display the sentences you like when playing them, but despite all these features, the most interesting feature of this software is called form to video form editing. For example, you can move each video forward or backward and crop from anywhere in the video. You can also add a different layer to each frame, give them an effect, and change the different parts of the film in different, beautiful, and forward ways. It can be said that you have to buy some of the features of this software. For example, you have to pay a fee to access some special effects and themes. Those who want to work very professionally and extraordinarily can pay a fee. And buy these themes and effects. But for ordinary users who do not want to do much. But you have access to all of the recent features for free by download kinemaster pro mod apk from RevDL. You can save your beautifully edited videos so that no quality is lost., <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2015/01/kinemaster_pro_video_editor_2.jpg\" alt=\"KineMaster mod apk download without watermark\" width=\"460\" height=\"280\" />, Tutorial Kinemaster Pro mod apk :, By entering and running the Kinemaster Pro mod apk program, you can place your video in any size you want in the ready-made formats for editing. In the editing section, there are tools. In this section, select the video you want through the media option, and after giving access to the program, upload it to this program. In addition to the media section called layer, rec, and audio., On the layer option, there are properties called media, effect, Text, Sticker, handwriting., With the media option, we can put another video or image on the videos we have. After selecting our desired media, we can add a list of available features for editing your media. This list has an option called trim or split. You can cut or even split your desired media with the help of play. You can place that line in the right place with the line you see and use the options available for cropping., The second option is split-screen, which is used for our images and media size on the current video. You can dedicate half of your page to new media., The third option is rotating/mirroring, which is used to rotate and mirror your new media on the current video. The fourth option is called animation, and with this option, you can specify how to enter your new media on the image., The fifth and sixth options, which are with the names overall, out, respectively, we see their animations, and they are almost related to our fourth option and are similar to each other, for how to run during the video time and how to get out of the video., The seventh option is called cropping, and we can cut our new media to the desired size, and the eighth option is called chroma key, and you can delete some of the colors in the media and give it a groundless back mode., The ninth and tenth options Called alpha filter, which is used for transparency and new media filters that we have added to the original video. The eleventh and twelfth options are called adjustment and blending, which are widely used for settings such as brightness, and you can see the Media Profile information option., With the effect option, you can give your favorite effects and effects to the video, and by clicking on the text tab, you can enter your text on the video. In the font section, we can add our desired font to the text, and in the color section, Text color settings are used. You can add interesting and various stickers to your video by going to the sticker option. Using the handwriting section, you can draw different shapes on your video with your finger and display them. Audio option You can add songs, sound effects, built-in audio media, and more to your video. In the rec section, you can record and add your own voice to your videos live. You can download and use this program and enjoy and edit your video easily., Download Kinemaster Pro Mod apk Full unlocked for android with premium features :, As we said, it is a video editing program that is one of the best and most successful editing programs. You can download Kinemaster pro mod apk from RevDL with premium features and without watermark and then install it on your android devices and enjoy it., , , , , How to Remove Watermark Ads ?Install KineMaster Mod Pro apk and you see any ads.what is kinemaster Mod Apk ?KineMaster Pro Mod Apk is for android devices . you can edit your video professionally.How To use KineMaster ?Please Go to Revdl.com And then search for KineMaster Mod Apk. Go to download Page And download Apk. Install Apk., , ",
    "downloadFile": [
      {
        "href": "https://s6.revdl.com/1901/KineMaster_Video_Editor_Pro_7.0.0.29940.GP__2539_Revdl.com.apk",
        "innerText": "Download Mod Apk [premium Unlocked][Arm]"
      },
      {
        "href": "https://s6.revdl.com/1901/KineMaster_Video_Editor_Pro_6.4.4.28911.GP_Arm64_v8a__6369_Revdl.com.apk",
        "innerText": "Download Mod Apk [premium Unlocked][Arm64]"
      },
      {
        "href": "https://s6.revdl.com/1901/KineMaster_Video_Editor_Pro_6.2.7.28255.GP_X86__9896_Revdl.com.apk",
        "innerText": "Download Mod Apk [premium Unlocked][X86]"
      },
      {
        "href": "https://s6.revdl.com/1901/KineMaster_Video_Editor_Pro_6.2.7.28255.GP_X86_64__4589_Revdl.com.apk",
        "innerText": "Download Mod Apk [premium Unlocked][X86_64]"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "Drops Language Learning Apk 36.61 Full for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "17 April 2023",
    "categories": "Apps,Education",
    "version": "36.61",
    "fileSize": "~60",
    "allText": "Drops Language Learning Apk 36.61 Full for android, Drops Language Learning  is an Education Game for androiddownload last version of Drops Language Learning  Apk for android from revdl with direct link, Pick up the essential words of these languages: Korean,  Japanese,   Chinese (both Mandarin Chinese & Cantonese Chinese),   Spanish (both Castilian Spanish & Latin-American Spanish),   English (both American English & British English),  French,  German,  Dutch,  Italian,  Russian,  Polish,   Portuguese (both European Portuguese & Brazilian Portuguese),  Hebrew,  Thai,  Arabic,  Turkish,  Tagalog (Filipino language),  Vietnamese,  Indonesian,  Danish,  Swedish,  Norwegian,  Icelandic,  Hungarian,  Hindi, Maori & Esperanto and Hawaiian!, Drops takes “boring” out of language learning: useful vocabulary is beamed into your memory via gorgeous minimalist illustrations and fast paced micro-games.The fun part? It only takes 5 minutes a day. In fact that’s all the time you get! Insane? Yes. Works? Absolutely!, Cornerstones of Drops:, Drops is 100% visual: We use pictures to directly connect the meaning to – not to your native language! No middleman. Quicker, better and more fun!  5 minute session limit: limiting learning time may sound counterintuitive but it makes Drops incredibly addictive which is not a bad thing when we talk about language learning. The barrier of entry is nonexistent. No excuses: you ALWAYS have 5 minutes! Effortless practice: We took a good look at why games are so fun and addictive and injected the essence into Drops to create an app that is freakishly immersive but in this case you don’t waste your time playing instead you build a valuable asset: knowledge of a new language.Rapid pace: We believe in quick pace and typing on your phone’s keyboard is nothing but fast. Say hello to rapid swipes and taps! You’ll need those extra seconds to get the most out of your 5 minutes  Vocabulary focus: No grammar, only curated words with high practical value. Drops focuses on one thing and it does it extremely well. Drops also teaches “alphabet” courses for beginners in Korean, Japanese, Chinese, Hebrew, Arabic, Russian and Hindi.Forge learning habit: Drops wants to convert you into a language learning addict. No matter how effective your learning tool is, if you don’t use it on a daily basis, it doesn’t really matter. Drops tricks your mind and you’ll be better for it!, Languages in DropsWe are proud of the wide range of languages that you can learn with Drops and we are adding new ones nearly every month. Besides the usual suspects such as English, Spanish, French, German, Italian, plenty of exotic ones are available too: Japanese, Chinese, Korean, Arabic, Hebrew, Portuguese, Russian, Danish, Hungarian, Hindi, Tagalog or Icelandic!, We recently introduced dialects too! No you can choose between Mandarin Chinese & Cantonese Chinese, Castilian Spanish & Latin-American Spanish, American English & British English and between European Portuguese & Brazilian Portuguese. You can even learn each language simultaneously for free!We are extremely proud to our beautiful word pronunciations recorded by voice actresses and actors!, Drops offer a complete package for free for casual learners: 5 minutes of blazingly fast and epic fun learning per day, more than 1700 words in 99 topics. More dedicated language learners can subscribe for premium features to achieve much faster progress and of course provides unlimited learning time. Our mission at Drops is to empower people of the world with the gift of language knowledge via a special tool that uses the universal language we all speak: images., p.s.: We take full responsibility for the potential addiction to language learning., —————– I’m sure you’ll love Drops as much as we enjoyed making it. If so, please leave us a review!, , ",
    "downloadFile": [
      {
        "href": "https://s14.revdl.com/1901/DROPS_Visual_Language_Learning_36.61__9809_Revdl.com.apk",
        "innerText": "Download Apk Arm v36.61"
      },
      {
        "href": "https://s14.revdl.com/1901/Learn_American_English_language_for_free_Drops_35.42_Arm64_v8a__1574_Revdl.com.apk",
        "innerText": "Download Apk Arm64 v35.42"
      },
      {
        "href": "https://s14.revdl.com/1901/Learn_American_English_language_for_free_Drops_34.68_x86_64__8077_Revdl.com.apk",
        "innerText": "Download Apk x86_64 v34.68"
      },
      {
        "href": "https://s14.revdl.com/1901/Learn_American_English_language_for_free_Drops_Premium_33.9+X86__9123_Revdl.net.apk",
        "innerText": "Download Apk x86 v33.9"
      },
      {
        "href": "https://s14.revdl.com/1901/Drops_Language_Learning_Learn_Premium_36.11__1805_Revdl.com.apk",
        "innerText": "Download Apk Premium v36.11"
      },
      {
        "href": "https://s14.revdl.com/1901/Learn_American_English_language_for_free_Drops_Premium_35.40_Arm64_v8a__9942_Revdl.com.apk",
        "innerText": "Download Apk Premium Arm64 v35.40"
      },
      {
        "href": "https://s14.revdl.com/1901/Learn_American_English_language_for_free_Drops_Premium_33.9+X86__9123_Revdl.net.apk",
        "innerText": "Download Apk Premium X86 v33.9"
      },
      {
        "href": "https://s14.revdl.com/1901/Learn_American_English_language_for_free_Drops_Premium_34.10+All_in_one__3897_Revdl.net.apk",
        "innerText": "Download Apk Premium v34.10 (All_in_one)"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "YoWindow Weather Apk 2.38.7 for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "17 April 2023",
    "categories": "Apps,Weather",
    "version": "2.38.7",
    "fileSize": "30 MB",
    "allText": "YoWindow Weather Apk 2.38.7 for android, YoWindow Weather is a weather app for android, download last version of YoWindow Weather Apk for android from revdl with direct link, YoWindow is a weather app with a beautiful design that advises you of the weather in your city at any given moment., YoWindow is a unique new weather app. The magic of YoWindow is a living landscape that reflects your actual weather. For instance, if it’s raining – it rains in YoWindow., The sunset and the sunrise in YoWindow happens at exactly the same time as in real life., But the great thing is you can scroll the time forward. Just swipe the screen and you will see how the weather is going to change throughout the day., Simple!\nAll the weather at your fingertips. You see the current weather, the forecast for today and for several days ahead., Beautiful!\nState of the art landscapes change depending on the season. The artwork is designed down to the smallest detail. Choose a landscape that fits best for your area., Handy!\nYoWindow is a window in your pocket =), The weather forecast is provided by yr.no and NWS – the leading meteorological organizations., Watch weather with pleasure!\nYoWindow team., ",
    "downloadFile": [
      {
        "href": "https://s3.revdl.com/1901/YoWindow_Weather_2.38.7__0122_Revdl.com.apk",
        "innerText": "Download Apk"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "Video Converter, Compressor MP4, 3GP, MKV,MOV, AVI Mod Apk 1.6.4 for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "17 April 2023",
    "categories": "Apps,Media & Video",
    "version": "1.6.4",
    "fileSize": "75 MB",
    "allText": "Video Converter, Compressor MP4, 3GP, MKV,MOV, AVI Mod Apk 1.6.4 for android, Video Converter, Compressor Apk Pro is a Tools Game for android, Fastest Video Converter and Compressor in the market that supports almost all video formats: MP4, MKV, AVI, 3GP, MOV, MTS, MPEG, MPG, WMV, M4V, VOB, FLV etc. This converter & compressor supports converting, compressing, changing resolution, Frame rate(FPS), bitrates of a video file. It can also convert video files into Audio formats like MP3, AAC, AC3, OGG, M4A, WAV etc., This video audio editor app also lets you trim/cut both audio and video as well as merge your audio and video files., KEY FEATURES:, Video Converter\n** Convert and Compress your video to almost any video and audio formats., Supported Formats: MP4, MKV, AVI, 3GP, FLV, MTS, M2TS, TS, MPEG, MPG, WMV, M4V, MOV, VOB, F4V, WEBM, DAV, DAT, MOVIE, MOD, MXF, LVF, H264., Resolution: Choose from predefined 4K resolution to 240P or put any custom resolution., Frame Rate: Choose from any predefined frame rates or put any custom frame rate., Subtitle Track: Choose from existing subtitles tracks of the video or upload subrip, mov_text, srt, webvtt, vtt format subtitles., Audio Track: Choose from existing audio tracks of the video to keep or add external audio tracks of mp3, aac, m4a, wav formats., Video & Audio Codecs: We support h264, mpeg4, mpeg1, mpeg2, flv1, vp8, vp9, wmv1, wmv2, aac, mp3, mp2, ac3, opus, vorbis, flac, alac, wmav1, wmav2 video and audio codecs., Rotate & Flip Video: Apply 90 degree clockwise/anticlockwise or 180 degree rotation and Flip videos vertically or horizontally., Compress option:, High Quality: This compression option uses X264 codec to compress your video keeping nearly original video quality., Video Bitrate: Reset video bitrate to compress the video to a specific size., Video Merger, ** Join/merge/concat multiple videos into one video in sequential, Top-Bottom or Side-By-Side style., Video Cutter, ** Cut and trim your video files. You can input the exact starting and ending cutting time precise to the milliseconds., Cut Video: This option keeps part of the video you selected., Trim Video: This option removes the selected part of the video if you enable the REMOVE SELECTED switch., Video to Audio\n** Convert videos to almost any audio format and also compress the audio., Supported Formats: MP3, M4A(AAC), AC3, WAV, OGG, FLAC. MP4, MKV, AVI, 3GP, FLV, MTS, M2TS, TS, MPEG, MPG, M4V, MOV, VOB, F4V, WEBM, WMV, DAV, DAT, MOVIE, MOD., Audio Cutter, ** Cut and trim your audio files. You can input the exact starting and ending cutting time precise to the milliseconds., Cut Audio: This option keeps part of the Audio you selected., Trim Audio: This option removes the selected part of the audio if you enable the REMOVE SELECTED switch., Audio Bitrate: Choose any audio bitrate while saving your cut audio., Output Format: MP4, MP3, M4A(AAC), AC3, WAV, OGG, FLAC., Audio Converter, ** Convert and Compress your audio to almost any audio format., Supported Formats: MP3, M4A(AAC), M4B(AAC), AC3, WAV, OGG, FLAC., Channel: Choose between mono and Stereo channel., Compress Section:, Encoding: We support both Constant Bitrate(CBR) and Variable Bitrate(VBR) encoding., Sample Rate: You can choose sample rate from 8K to 48K., Audio merger\n** Merge almost any format Audios to any other format. We support MP3, M4A(AAC), M4B(AAC), AC3, WAV, OGG, FLAC files as input and output formats., Batch Processing, ** Users can queue multiple files for processing. All our features support Batch processing., download last version of Video Converter, Compressor  Full Apk for android from revdl with direct link, ",
    "downloadFile": [
      {
        "href": "https://s1.revdl.com/1901/Video_Converter_1.6.4__4216_Revdl.com.apk",
        "innerText": "Download Apk v1.6.4"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "TapScanner Premium Mod Apk 2.8.11 for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "17 April 2023",
    "categories": "Apps,Tools",
    "version": "2.8.11",
    "fileSize": "49 MB",
    "allText": "TapScanner – Camera Scanner To Pdf Mod Apk 2.8.11 (Premium) for android, TapScanner Premium Apk is a Tools app for android., Download latest version of TapScanner Premium mod Apk for android from RevDL with direct link., Scan all kinds of documents, bank cards and receipts as quickly as possible and save your files in all kinds of formats., <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Scanner-App-To-PDF-TapScanner-1.jpg\" alt=\"TapScanner premium mod apk\" width=\"299\" height=\"533\" />, <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Scanner-App-To-PDF-TapScanner-2.jpg\" alt=\"TapScanner mod apk\" width=\"299\" height=\"533\" />, <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Scanner-App-To-PDF-TapScanner-3.jpg\" alt=\"TapScanner mod premium apk\" width=\"299\" height=\"533\" />, ",
    "downloadFile": [
      {
        "href": "https://s1.revdl.com/1901/TapScanner_Premium_2.8.11__3651_Revdl.com.apk",
        "innerText": "Download Mod Apk v2.8.11 Premium"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "Sweet Selfie Mod Apk 5.2.1522 Premium for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "17 April 2023",
    "categories": "Apps,Camera",
    "version": "5.2.1522",
    "fileSize": "109 MB",
    "allText": "Sweet Selfie Mod Apk 5.2.1522 Premium for android, Sweet Selfie Mod Apk Premium is a camera app for android. This app is developed by Sweet Selfie Inc and published on Google Play. The app is now available for $29.99. Download latest version of Sweet Selfie Pro Full Apk for android from revdl with direct link., <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Sweet-Selfie-1.jpg\" alt=\"Sweet Selfie mod apk\" width=\"299\" height=\"533\" />, <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Sweet-Selfie-2.jpg\" alt=\"Sweet Selfie premium apk\" width=\"299\" height=\"533\" />, <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Sweet-Selfie-3.jpg\" alt=\"Sweet Selfie pro apk\" width=\"299\" height=\"533\" />, ",
    "downloadFile": [
      {
        "href": "https://s1.revdl.com/1901/Sweet_Selfie_Pro_5.2.1522__5361_Revdl.com.apk",
        "innerText": "Download Apk Pro v5.2.1522"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "Perfect Me Mod Apk 8.2.7 [Premium Unlocked] for android",
    "imgSrc": "https://www.revdl.com/wp-content/uploads/2022/06/Perfect-Me-Body.jpg",
    "createdAt": "17 April 2023",
    "categories": "Apps,Photography",
    "version": "8.2.7",
    "fileSize": "85 MB",
    "allText": "Perfect Me Mod Apk 8.2.7 [Premium Unlocked] for android, Perfect Me Mod Apk is a Tools Game for android, download latest version Perfect Me Mod Apk [Premium Unlocked] Full Apk for android from revdl with direct link., Easily retouch your images using this program. Remove all kinds of spots on your face and body. You can also grow hair or whiten your teeth., <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Perfect-Me-Body-1.jpg\" alt=\"Perfect Me Mod Apk\" width=\"299\" height=\"533\">, <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Perfect-Me-Body-2.jpg\" alt=\"Perfect Me Mod unlocked\" width=\"299\" height=\"533\">, <img decoding=\"async\" class=\"aligncenter\" src=\"https://image.revdl.com/2019/Perfect-Me-Body-3.jpg\" alt=\"Download mod Perfect Me apk unlocked\" width=\"299\" height=\"533\">, ",
    "downloadFile": [
      {
        "href": "https://s1.revdl.com/1901/Perfect_Me_Unlocked_8.2.7__3026_Revdl.com.apk",
        "innerText": "Download Mod Apk v8.2.7 [Premium Unlocked]"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  },
  {
    "title": "Hibernator – Hibernate apps & Save battery Mod Apk 2.29.1 Hack for android",
    "imgSrc": "data:image/gif;base64,R0lGODdhAQABAPAAAMPDwwAAACwAAAAAAQABAAACAkQBADs=",
    "createdAt": "17 April 2023",
    "categories": "Apps,Tools",
    "version": "2.29.1",
    "fileSize": "10 MB | 3 MB",
    "allText": "Hibernator – Hibernate apps & Save battery Mod Apk 2.29.1 Hack for android, Hibernator – Hibernate apps & Save battery  is a Tools Game for android\ndownload last version of Hibernator – Hibernate apps & Save battery  Apk for android from revdl with direct link, Mod Features:, Pro features UnlockedAOSP CompatibleIAP/Ads Libs and Services RemovedLog/Debug System RemovedWorks Offline, Hibernator provides an easy way to stop all running apps and as a result it saves the battery power and improves performance, and it can also close apps automatically everytime the screen is turned off., This app improves your phone’s performance\n☆ By speeding up your phone\n☆ By freeing the memory\n☆ By saving the battery\n☆ By cooling your phone, Your phone keeps many apps running in the background, which is consuming your system resources, and as a result draining your battery and reducing the available memory., Features:\n✓ Close all running apps\n✓ Close background tasks and services\n✓ Supports user apps and system apps\n✓ Widget\n✓ Automatically close of apps when the screen is turned off\n✓ Shortcuts, TASK KILLER\nThis app is a very powerful Task Killer that kill tasks and processes., SPEED BOOSTER\nThis app lets you speed up your phone when it runs slowly because of the many background running apps., RAM CLEANER\nThis app optimize your phone memory by freeing up RAM, and making space for new apps., BATTERY SAVER\nClosing apps helps save battery power and extend battery life., CPU COOLER\nClosing apps helps Cool down your phone temperature and reduces CPU usage., What is the difference between KillApps and Hibernator ?\nHibernator is more advanced than Killapps, since it lets you close apps automatically everytime the screen is turned off., Your privacy is safe\n✓ This app does not collect any data., This app uses Accessibility services\nThis app is a great automated solution for users with physical disabilities and muscle fatigue, who struggle while interacting with the screen, especially when doing repetitive complicated tasks such as force closing many apps one by one., This app automates one of the most repeating task with the user-interface , the task of “force closing running apps” ! and It does so, by closing all the apps, one by one in an automated way, and hence helps users with physical disabilities and muscle fatigue avoid to manually close each app in the system settings., Permissions\n✓ This app requires the accessibility service permission in order to be able to close other apps.\n⇒ This app will be able to retrieve the active window content in order to find the button which forces closing an app in the system settings, then emulate a click action.\n⇒ This app will be able to observe the actions related to the interface in order to guide the process of automating the task of closing apps , by monitoring the transition between windows during the emulation of interaction with the interface., ✓ This app requires the permission to draw above the other apps in order to be able to show the wait screen while closing apps., ✓ This app requires the permission to modify system settings in order to be able to turn off the screen after the hibernation operation is completed, ",
    "downloadFile": [
      {
        "href": "https://s13.revdl.com/1901/Hibernator_Pro_2.29.1__0681_Revdl.com.apk",
        "innerText": "Download Apk v2.29.1"
      },
      {
        "href": "https://s13.revdl.com/1901/Hibernator_Pro_2.29.1_Mod__7538_Revdl.com.apk",
        "innerText": "Download Apk Mod v2.29.1"
      },
      {
        "href": "https://www.youtube.com/channel/UCzXVrXfsiTzDWMjpJEFhRAw/",
        "innerText": "Subscribe Youtube"
      }
    ]
  }
]